Repository: kyosuken/simpleValidator
Catalog: simplevalidator/lang/*/LC_MESSAGES/simpleValidator.po
Languages: ca

source: {} is required
ca: {} és obligatori

source: {} must be a valid email
ca: {} cal que sigui una adreça de correu electrònic vàlida

source: {} must be more than {} characters
ca: {} cal que tingui més de {} caràcters

source: {} must be higher than {}
ca: {} cal que sigui més gran que {}

source: {} must be less than {} characters
ca: {} cal que tingui menys de {} caràcters

source: {} must be lower than {}
ca: {} cal que sigui més petit que {}

source: {}'s length must be between {} and {} characters
ca: {} cal que tingui una llargada entre {} i {} caràcters

source: {}'s value must be higher than {} and lower than {}
ca: {} cal que el valor sigui més gran que {} i més petit que {}

source: {} must be a valid ipv4 address
ca: {} cal que sigui una adreça ipv4 vàlida

source: {} must be a valid ipv6 address
ca: {} cal que sigui una adreça ipv6 vàlida

source: {} must be numerical
ca: {} cal que sigui un número

source: {} must be an integer
ca: {} cal que sigui un número enter

source: {} must be a positive integer
ca: {} cal que sigui un número enter positiu

source: {} must be a valid url
ca: {} cal que sigui una adreça URL vàlida

source: {} must contain only alphabetical characters
ca: {} només pot contenir caràcters de l'alfabet

source: {} must contain only alphabetical characters and/or numbers
ca: {} només pot contenir caràcters de l'alfabet i números

source: {} must contain only alphabetical characters or numbers or underscores and dashes
ca: {} només pot contenir caràcters de l'alfabet, números o guions

source: {} is not a valid date, the format must be {}
ca: {} no és una data vàlida, el format cal que sigui {}
